chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/ports/processor/ports_p32mx564f128h.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _PORTS_P32MX564F128H_H
#define _PORTS_P32MX564F128H_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    PORTS_ID_0 = 0,
    PORTS_NUMBER_OF_MODULES

} PORTS_MODULE_ID;

typedef enum {

    PORTS_PIN_MODE_ANALOG = 0,
    PORTS_PIN_MODE_DIGITAL = 1

} PORTS_PIN_MODE;

typedef enum {

    CN8 = 8,
    CN9 = 9,
    CN10 = 10,
    CN11 = 11,
    CN7 = 7,
    CN6 = 6,
    CN5 = 5,
    CN4 = 4,
    CN3 = 3,
    CN2 = 2,
    CN12 = 12,
    CN17 = 17,
    CN18 = 18,
    CN1 = 1,
    CN0 = 0,
    CN13 = 13,
    CN14 = 14,
    CN15 = 15,
    CN16 = 16

} PORTS_CHANGE_NOTICE_PIN;

typedef enum {

    CHANGE_NOTICE_PIN_0 = 0x00001,
    CHANGE_NOTICE_PIN_1 = 0x00002,
    CHANGE_NOTICE_PIN_2 = 0x00004,
    CHANGE_NOTICE_PIN_3 = 0x00008,
    CHANGE_NOTICE_PIN_4 = 0x00010,
    CHANGE_NOTICE_PIN_5 = 0x00020,
    CHANGE_NOTICE_PIN_6 = 0x00040,
    CHANGE_NOTICE_PIN_7 = 0x00080,
    CHANGE_NOTICE_PIN_8 = 0x00100,
    CHANGE_NOTICE_PIN_9 = 0x00200,
    CHANGE_NOTICE_PIN_10 = 0x00400,
    CHANGE_NOTICE_PIN_11 = 0x00800,
    CHANGE_NOTICE_PIN_12 = 0x01000,
    CHANGE_NOTICE_PIN_13 = 0x02000,
    CHANGE_NOTICE_PIN_14 = 0x04000,
    CHANGE_NOTICE_PIN_15 = 0x08000,
    CHANGE_NOTICE_PIN_16 = 0x10000,
    CHANGE_NOTICE_PIN_17 = 0x20000,
    CHANGE_NOTICE_PIN_18 = 0x40000,
    CHANGE_NOTICE_PIN_ALL = 0x7FFFF

} PORTS_CN_PIN;

typedef enum {

    PORTS_ANALOG_PIN_0 = 0,
    PORTS_ANALOG_PIN_1 = 1,
    PORTS_ANALOG_PIN_2 = 2,
    PORTS_ANALOG_PIN_3 = 3,
    PORTS_ANALOG_PIN_4 = 4,
    PORTS_ANALOG_PIN_5 = 5,
    PORTS_ANALOG_PIN_6 = 6,
    PORTS_ANALOG_PIN_7 = 7,
    PORTS_ANALOG_PIN_8 = 8,
    PORTS_ANALOG_PIN_9 = 9,
    PORTS_ANALOG_PIN_10 = 10,
    PORTS_ANALOG_PIN_11 = 11,
    PORTS_ANALOG_PIN_12 = 12,
    PORTS_ANALOG_PIN_13 = 13,
    PORTS_ANALOG_PIN_14 = 14,
    PORTS_ANALOG_PIN_15 = 15

} PORTS_ANALOG_PIN;

typedef enum {

    PORTS_AN_PIN_0 = 0x0001,
    PORTS_AN_PIN_1 = 0x0002,
    PORTS_AN_PIN_2 = 0x0004,
    PORTS_AN_PIN_3 = 0x0008,
    PORTS_AN_PIN_4 = 0x0010,
    PORTS_AN_PIN_5 = 0x0020,
    PORTS_AN_PIN_6 = 0x0040,
    PORTS_AN_PIN_7 = 0x0080,
    PORTS_AN_PIN_8 = 0x0100,
    PORTS_AN_PIN_9 = 0x0200,
    PORTS_AN_PIN_10 = 0x0400,
    PORTS_AN_PIN_11 = 0x0800,
    PORTS_AN_PIN_12 = 0x1000,
    PORTS_AN_PIN_13 = 0x2000,
    PORTS_AN_PIN_14 = 0x4000,
    PORTS_AN_PIN_15 = 0x8000,
    PORTS_AN_PIN_ALL = 0xFFFF

} PORTS_AN_PIN;

typedef enum {

    PORTS_BIT_POS_0 = 0,
    PORTS_BIT_POS_1 = 1,
    PORTS_BIT_POS_2 = 2,
    PORTS_BIT_POS_3 = 3,
    PORTS_BIT_POS_4 = 4,
    PORTS_BIT_POS_5 = 5,
    PORTS_BIT_POS_6 = 6,
    PORTS_BIT_POS_7 = 7,
    PORTS_BIT_POS_8 = 8,
    PORTS_BIT_POS_9 = 9,
    PORTS_BIT_POS_10 = 10,
    PORTS_BIT_POS_11 = 11,
    PORTS_BIT_POS_12 = 12,
    PORTS_BIT_POS_13 = 13,
    PORTS_BIT_POS_14 = 14,
    PORTS_BIT_POS_15 = 15

} PORTS_BIT_POS;

typedef enum {

    PORTS_REMAP_INPUT_FUNCTION_NONE

} PORTS_REMAP_INPUT_FUNCTION;

typedef enum {

    PORTS_REMAP_INPUT_PIN_NONE

} PORTS_REMAP_INPUT_PIN;

typedef enum {

    PORTS_REMAP_OUTPUT_FUNCTION_NONE

} PORTS_REMAP_OUTPUT_FUNCTION;

typedef enum {

    PORTS_REMAP_OUTPUT_PIN_NONE

} PORTS_REMAP_OUTPUT_PIN;

typedef enum {

    PORT_CHANNEL_B = 0x01,
    PORT_CHANNEL_C = 0x02,
    PORT_CHANNEL_D = 0x03,
    PORT_CHANNEL_E = 0x04,
    PORT_CHANNEL_F = 0x05,
    PORT_CHANNEL_G = 0x06

} PORTS_CHANNEL;

typedef enum {

    PORTS_CHANGE_NOTICE_EDGE_NONE

} PORTS_CHANGE_NOTICE_EDGE;

typedef enum {

    PORTS_PIN_SLEW_RATE_NONE

} PORTS_PIN_SLEW_RATE;

typedef enum {

    PORTS_CHANGE_NOTICE_METHOD_NONE

} PORTS_CHANGE_NOTICE_METHOD;

PLIB_INLINE SFR_TYPE* _PORTS_READ_B_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &PORTB;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_WRITE_B_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &LATB;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_DIRECTION_B_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &TRISB;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_OPEN_DRAIN_B_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &ODCB;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_READ_C_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &PORTC;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_WRITE_C_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &LATC;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_DIRECTION_C_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &TRISC;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_OPEN_DRAIN_C_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &ODCC;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_READ_D_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &PORTD;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_WRITE_D_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &LATD;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_DIRECTION_D_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &TRISD;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PORTS_OPEN_DRAIN_D_VREG(PORTS_MODULE_ID i)
{
    switch (i) {
        case PORTS_ID_0 :
            return &ODCD;
        case PORTS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

